---
title: AnnotationSymbol
classe: Autodesk.Revit.DB.AnnotationSymbol
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.FamilyInstance
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 5
---

# AnnotationSymbol

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `AnnotationSymbolType AnnotationSymbolType { get; set; }` | `annotationSymbol.AnnotationSymbolType` | AnnotationSymbolType |
| `Void addLeader()` | `annotationSymbol.addLeader()` | Void |
| `AnnotationSymbol duplicate()` | `annotationSymbol.duplicate()` | AnnotationSymbol |
| `IList<Leader> GetLeaders()` | `annotationSymbol.GetLeaders()` | IList<Leader> |
| `Void removeLeader()` | `annotationSymbol.removeLeader()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```